import { Title } from '../../common-component/Title/Title.jsx'
import style from './NPC.module.css'
import image1 from "../../../img/jpg/slider/1.jpg";
import image2 from "../../../img/jpg/slider/2.jpg";
import image3 from "../../../img/jpg/slider/3.jpg";
import { useState } from 'react';
// style was imported in index.css
// import "react-slideshow-image/dist/styles.css";


export const NPC = (props) => {
	let [slide, changeSlide] = useState(1)
	console.log(slide);
	let img = [image1, image2, image3]
	let l = img.length

	let next = () => {
		if (slide === l - 1) {
			changeSlide(0)
		}
		else changeSlide(slide + 1)
	}
	let previous = () => {
		if (slide === 0) {
			changeSlide(l - 1)
		}
		else changeSlide(slide - 1)
	}

	return <div>
		<div className={style.block1}>
			<div>
				<Title text="Навчально - Практичний Центр" />
				<p><span>Навчально-практичний центр (НПЦ)</span> – це частина приміщень закладу професійної освіти з новим обладнанням та технікою. Там учні проводять практичні заняття, а дорослі – підвищують кваліфікацію або перенавчаються.</p>
				<h2>Навчально-практичний центр “Електромонтер з ремонту та обслуговування устаткування”</h2>
				<p>3 березня на базі ДНЗ «Корсунь-Шевченківський професійний ліцей» відбулося відкриття навчально-практичного центру, де на сьогоднішній день готують  фахівців за професією  «Електромонтер з ремонту та обслуговування електроустаткування»</p>
				<p>Навчально-практичний центр у своїй діяльності керується Конституцією України, Законом України “Про освіту”, “Про професійну (професійно-технічну) освіту”, “Про повну загальну середню освіту”, “Положенням про організацію навчально-виробничого процесу в професійній (професійно-технічній) освіті”, Статутом ліцею, а також  Положенням про навчально-практичний центр (за галузевим спрямуванням) професійно-технічного навчального закладу.</p>
			</div>
			<div>
				<div className={style.slider}>
					<div>
						<button onClick={previous}>Previous</button>
						<button onClick={next}>Next</button>
					</div>

					{
						img.map((el, index) => {

							return index === slide ? <img src={el} alt={el} /> : undefined
						})
					}
				</div>
			</div>
		</div>
		<div className={style.block2}>
			<p>Діяльність навчально-практичного центру забезпечує:</p>
			<ul>
				<li>– тісну співпрацю з роботодавцями, надання робочих місць;</li>
				<li>– проведення пробних кваліфікаційних робіт на підприємствах;</li>
				<li>– позитивні відгуки керівників підприємств про рівень підготовки наших учнів;</li>
				<li>– проведення спільних навчально-практичних заходів з представниками підприємств;</li>
				<li>– спільна співпраця представників підприємств з подальшим працевлаштуванням учнів;</li>
				<li>– якісна підготовка учнів, а це і отримання робочих місць та  гідна оплаті праці;</li>
				<li>– упровадження елементів дуальної форми навчання;</li>
				<li>– підвищення престижу робітничих професій і навчального закладу.</li>
			</ul>
			<p>Сьогодні навчально-практичний центр забезпечений сучасними інтерактивними комплексами, зручними меблями, новітнім виробничим обладнанням, комп’ютерною та мультимедійною технікою.  Для ефективної роботи навчально-практичного центру було закуплено: столи монтажні промислові у комплекті, розподільчі щити, компресор, витяжний пристрій, димопоглиначі з вугільним фільтром, переносні заземлення, заземлення глибинні, амперметри, вольтметри, мультиметри, мегомметри, динамометр, конденсатори, лічильники активної енергії, паяльники, слюсарні інструменти, прилад для визначення місця пошкодження кабелів, приладдля випробовування ізоляції високовольтних кабелів, прилад для визначення дефектних ізоляторів на робочу напругу та ін. Це саме те обладнання, яке учні зможуть побачити, прийшовши на виробництво, а вже сьогодні бачать у закладі освіти.</p>
		</div>
	</div>
}