import { Title } from "../../common-component/Title/Title"
import style from './AboutUs.module.css'
import img1 from "../../../img/jpg/about-us/1.jpg";
import img2 from "../../../img/jpg/about-us/2.jpg";
import img3 from "../../../img/jpg/about-us/3.jpg";
import img4 from "../../../img/jpg/about-us/4.jpg";
import img5 from "../../../img/jpg/about-us/5.jpg";
import img6 from "../../../img/jpg/about-us/6.jpg";
import img7 from "../../../img/jpg/about-us/7.jpg";
import img8 from "../../../img/jpg/about-us/8.jpg";
import img9 from "../../../img/jpg/about-us/9.jpg";
import img10 from "../../../img/jpg/about-us/10.jpg";
import img11 from "../../../img/jpg/about-us/11.jpg";

export const AboutUs = (props) => {
	return <div>
		<Title text="Про нас" />
		<h1>Корсунщина — край овіяний духом звитяги, мужності та прадавньої слави, земля легендарного  людського подвигу. Тисячолітня історія Корсунщини промовляє до людей багатьма пам’ятками археології, архітектури, історії, мистецтва та природи. </h1>
		<div className={style.block1}>
			<h3>Державний  навчальний  заклад  “Корсунь-Шевченківський  професійний ліцей” розташований на Валковському острові між м. Корсунь-Шевченківський і с. Набутів.</h3>
			<p>До 1924 року на цьому острові був розташований Онуфріївський монастир. Згідно з постановою Президії окрвиконкому від 13 червня 1923 року монастир із усіма угіддями переданий соцзабезу для інвалідного містечка з метою організації сільськогосподарських виробничих майстерень, а монашки були безболісно переведені в Богуславський монастир. На базі інвалідного містечка в 1928 році було створено школу захисту рослин у Київській області. А в 1934 році створено школу тракторних бригадирів, де готовились механізаторські кадри для Радянського Союзу.</p>
			<p>В 1944 році школа тракторних бригадирів перейменована в Гарбузинську школу механізації. Школа готовила механізаторів широкого профілю. База школи становила -12 тракторів, 24 одиниці іншої сільськогосподарської техніки. В 1954 році школа механізації перейменована в училище механізації сільського господарства. З 1954 по 1964 рік навчаль-ний заклад підготував для освоєння цілинних земель Казахстану 1402 тракториста і 688 механіків-комбайнерів. В 1974 році училище реорганізовано в середній професійно-технічний навчальний заклад.</p>
			<p>В 1984 році Гарбузинське училище було перейменовано у сільське професійно-технічне училище №33.</p>
			<p>В 2003 році професійно – технічне училище №33 реорганізовано у Корсунь-Шевченківський професійний аграрний ліцей.  З  1  вересня  2009 року  в  результаті  об”єднання  Корсунь-Шевченківського  професійного аграрного  ліцею  та  Стеблівського  ПТУ №39  навчальний  заклад  перейменовано  в  державний  навчальний заклад  “Корсунь-Шевченківський  професійний  ліцей”.  Наші  контакти:</p>
			<p>вул. Перемоги, 226, м.Корсунь-Шевченківський, Черкаська область, 19400, тел. <a href="tel:3-09-73">3-09-73 </a>e-mail: <a href="mailto:e-mail: agroliceum@ukr.net">agroliceum@ukr.net</a></p>
		</div>
		<div className={style.block2}>
			<h2>Екскурс в історію</h2>

			<p><span>ДНЗ “Корсунь-Шевченківський професійний ліцей”</span> засновано в <span>1934</span> році на базі обласної школи захисту рослин, як школу тракторних бригадирів. Цей навчальний заклад готував робітничі кадри для великого регіону України, обігрів і врятував чимало дітей-сиріт у післявоєнні роки.</p>
			<img src={img1} alt="img1" />

			<p>Першим директором був <span>Костенко Іван Олександрович</span></p>
			<img src={img2} alt="img2" />

			<p>З <span>1944</span> по <span>1970</span> рік посаду директора обіймає почесний робітник профтехосвіти <span>Зимбалевський Михайло Семенович</span>.</p>
			<img src={img3} alt="img3" />

			<p><span>1944</span> року школу тракторних бригадирів перейменовано в школу механізації, а з <span>1954</span> року – в училище механізації. З <span>1970</span> по <span>1975</span> рік училище очолює <span>Романенко Леонтій Єфремович</span>.</p>
			<img src={img4} alt="img4" />

			<p>З <span>1975</span> по <span>1977</span> навчальний заклад працює під керівництвом <span>Костенка Миколи Петровича</span>.</p>
			<img src={img5} alt="img5" />

			<p>Як бачимо, навчальний заклад не один раз реорганізовувався, змінював назву. Змінювалося покоління викладачів та майстрів виробничого навчання. З 1974 року училище одним з перших в області почало поряд з професією давати й середню освіту.</p>
			<p>З <span>1977</span> і до <span>2008</span> року навчальний заклад очолив <span>Максименко Василь Костянтинович</span>. </p>
			<img src={img6} alt="img6" />

			<p>З <span>2008</span> по <span>2011</span> рік посаду директора обіймав <span>Костенко Михайло Васильович</span>.</p>
			<img src={img7} alt="img7" />

			<p>З грудня <span>2011</span> по вересень <span>2012</span> року ліцей очолював <span>Гаркуша Ігор Анатолійович</span>.</p>
			<img src={img8} alt="img8" />

			<p>З 1 жовтня <span>2012</span> року по серпень <span>2018</span> року ліцей очолювала <span>Кияниця Ніна Віталіївна</span>.</p>
			<img src={img9} alt="img9" />

			<p>З <span>30 серпня 2018</span> року директором державного навчального закладу “Корсунь-Шевченківський професійний ліцей” є <span>Марина Олексіївна Лизогуб</span>.</p>
			<img src={img10} alt="img10" />

			<h3>Сьогодні наш ліцей – сучасний заклад освіти, який готує кваліфікованих робітників для різних галузей народного господарства України.</h3>
			<img src={img11} alt="img11" />

		</div>
	</div>
}